# PANDAS
 - http://pandas.pydata.org/pandas-docs/stable/10min.html
 - https://databricks.com/blog/2015/08/12/from-pandas-to-apache-sparks-dataframe.html
 - https://github.com/fonnesbeck/statistical-analysis-python-tutorial
 
Built on top of NumPy
in R sono data.frame    
fixed-length, ordered dict, as it is a mappingof index values to data values

##Contents
- [series](#series)
   - [create](#cts) [describe](#ds) [indexing](#is) [delete](#dels) [append](#as) [union](#unions) [transpose](#trs) [diff](#diffs)    [order_sort_rank](#ords)  [Missing val](#mvs)
- [dataframe](#dataframe)
   - [create](#ctd) [describe](#dd) [indexing](#idd)  [iterate](#iterate)  [delete](#dels) [append](#ad) [union](#uniond) [transpose](#trd) [diff](#diffd) [order_sort_rank](#ordd)  [Missing val](#mvd)
- [broadcast](#broadcastd) [lambda](#lambdad)  [binning](#binningd)    [search](#searchd)   [file](#file)

## SERIES
<a id="series"></a>

In [ ]:
 1-D Array
         Index         Data
         0              X0
         1              X1
         2              X2
         3              X3   
         4              X4

###create
<a id="cts"></a>

In [1]:
from pandas import Series, DataFrame
import pandas as pd

ser=pd.Series([100, 101, 102, 103])
print ser
print("------Values")
print(ser.values)
print("------Index") 
print(ser.index) 

print('\n\nCreate from a DICT ---')
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}#Series from a DICT
ser = Series(sdata)
print ser

0    100
1    101
2    102
3    103
dtype: int64
------Values
[100 101 102 103]
------Index
Int64Index([0, 1, 2, 3], dtype='int64')


Create from a DICT ---
Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

##describe
<a id="ds"></a>

REFER to DESCRIBE dataframe
http://localhost:8888/notebooks/python2015/language/pandas.ipynb#ds

##missing values
<a id="mvs"></a>

seee the dataframe part

##indexing
<a id="is"></a>

In [23]:
obj2 = Series([100, 101, 102, 103], index=['d', 'b', 'a', 'c'])
print('renamed Indexes')
print(obj2)
print "obj2[d] ",obj2['d']
print "obj2[obj2 > 101] " ,obj2[obj2 > 101]
print('Name: the Serie itself (population)')
obj4.name = 'population'
print('      the INDEXES  (state) it becomes a COLUMN')
obj4.index.name = 'state'
print(obj4)
#Same object , Different indexes
#select d,c,b,a from tab
obj=Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print(obj)
print("reindexed -------")
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'],fill_value=0)
print(obj2)
#Column reordered
# select c,b,a ftom tab
frame_col_reordered=DataFrame(data, columns=['year', 'state', 'pop'])
frame_col_reordered

--------------------------------------------------
renamed Indexes
d    100
b    101
a    102
c    103
dtype: int64
--------------------------------------------------
Select Value from Serie where indexid=d
100
--------------------------------------------------
Select Value from Serie where indexid in (c,a,d)
c    103
a    102
d    100
dtype: int64
--------------------------------------------------
Select Value from Serie where Value > 101
a    102
c    103
dtype: int64
--------------------------------------------------
Exists   where index =b ?
True
--------------------------------------------------
Are elements Null?
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
import pandas as pd
obj2 = pd.Series([100, 101, 102, None,103])
idx = obj2.isnull()
print "is null",idx
print "nulli", obj2[obj2.isnull()]

is null 0    False
1    False
2    False
3     True
4    False
dtype: bool
nulli 3   NaN
dtype: float64

<a id="dels"></a>
### DELETE

In [ ]:
print('not a DELETE cause create a new OBJ')
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd', ])
new_obj = obj.drop('c') #OBJ is not dropped from OBJ!!!!
print('select * from (select * from T1 where ROWID<> c)')
print('ORIGINAL')
print(obj)
print('without index C')
print(new_obj)

baseball.drop([89525, 89526])

##append
<a id="as"></a>

##union
<a id="unions"></a>

##transpose
<a id="trs"></a>

##diff
<a id="diffs"></a>

##order_sort_rank
<a id="ords"></a>

In [ ]:
baseball_newind.sort_index().head()
baseball.hr.order(ascending=False)

<a id="dataframe"></a>
## DATAFRAME

In [ ]:
         Index         
           0      1    2    3     
S1         
         Data
           X0    X1    X2    X3
S2           
         Data
           X0    X1    X2    X3
S3            
         Data
           X0    X1    X2    X3

### Create
<a id="ctd"></a>

In [ ]:
2D 
    ndarray A matrix of data, passing optional row and column labels
dict    of arrays, lists, or tuples 
    Each sequence becomes a column in the DataFrame. All sequences must be the same length.
NumPy
    structured/record array Treated as the “dict of arrays” case
dict of Series
    Each value becomes a column. Indexes from each Series are unioned together to form the
result’s row index if no explicit index is passed.
dict of dicts
    Each inner dict becomes a column. Keys are unioned to form the row index as in the “dict ofSeries” case.
list of dicts or Series 
    Each item becomes a row in the DataFrame. Union of dict keys or Series indexes become the
DataFrame’s column labels
List of lists or tuples 
    Treated as the “2D ndarray” case
Another DataFrame
    The DataFrame’s indexes are used unless different ones are passed
NumPy MaskedArray
    Like the “2D ndarray” case except masked values become NA/missing in the DataFrame result

In [ ]:
#read csv with header 
df1 = pandas.read_csv(file, header=0,
                      , index_col=False,
                      delimiter="\t")

In [5]:
#from DICT
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],#Column 1
        'year': [2000, 2001, 2002, 2001, 2002],#Column 2
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}#Column 3
frame = DataFrame(data)
print(frame)
frame2 = DataFrame(data, 
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five']
                   )
print(frame2)
#from numpy array
import numpy as np
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
                   A         B         C         D
2013-01-01 -0.257095  0.113133  1.994696 -0.679480
2013-01-02 -1.187544 -0.685537  0.179903 -0.564430
2013-01-03  1.287338 -0.909575 -0.541147  0.294461
2013-01-04 -0.192245  0.689668 -0.629827 -0.271434
2013-01-05  0.469157  0.695376  0.397645  2.206244
2013-01-06  0.578898  0.036149 -0.361915  1.392474

##describe
<a id="dd"></a>

In [10]:
print "-1",frame2.columns
print "-2",frame2.values
print "-3",frame2.dtypes

print frame2.head(2)
print frame2.tail(2)
print frame2.describe()

-1 Index([u'year', u'state', u'pop', u'debt'], dtype='object')
-2 [[2000L 'Ohio' 1.5 nan]
 [2001L 'Ohio' 1.7 nan]
 [2002L 'Ohio' 3.6 nan]
 [2001L 'Nevada' 2.4 nan]
 [2002L 'Nevada' 2.9 nan]]
-3 year       int64
state     object
pop      float64
debt      object
dtype: object
     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN
      year   state  pop debt
four  2001  Nevada  2.4  NaN
five  2002  Nevada  2.9  NaN
             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

##missing values
<a id="mvd"></a>

In [27]:
df = pd.DataFrame([
                  [None ,300,None,200,150],
                  [None ,300,None,200,100],
                  [1,1,1,1,1]
                  ]
                  )
print "000"
print df
print "001"
print df.fillna(0)


print "002"
print df.mean()
print "003"
print df.fillna(df.mean())
print "004"
print df.mean(skipna=False)

_ = data.year.fillna(2013, inplace=True)
data

000
    0    1   2    3    4
0 NaN  300 NaN  200  150
1 NaN  300 NaN  200  100
2   1    1   1    1    1
001
   0    1  2    3    4
0  0  300  0  200  150
1  0  300  0  200  100
2  1    1  1    1    1
002
0      1.000000
1    200.333333
2      1.000000
3    133.666667
4     83.666667
dtype: float64
003
   0    1  2    3    4
0  1  300  1  200  150
1  1  300  1  200  100
2  1    1  1    1    1
004
0           NaN
1    200.333333
2           NaN
3    133.666667
4     83.666667
dtype: float64

NameError: name 'data' is not defined

<a id="iterate"></a>
### iterate rows

In [ ]:
for i in  df1.values:
    print i

##indexing
<a id="id"></a>
http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing

In [52]:
frame2=DataFrame(data, 
              columns=['year', 'state', 'pop', 'debt'],
              index=['one', 'two', 'three', 'four', 'five'])
frame2

print(frame2['state'] )#frame2.state
print(frame2.ix['three'])

#here the unclear....
frame3.index.name = 'year'
frame3.columns.name = 'state'
print(frame3)
print(frame3.values)
#RETRIEVE A COLUMN
#select a from tab
print("Column:",
frame2.state )
#frame2['state']  alternative syntax

#RETRIEVE A ROW
print("Row:",
frame2.ix['three'])

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
[[ nan  1.5]
 [ 2.4  1.7]
 [ 2.9  3.6]]

In [71]:
#ITERATING over groups
for name, group in df.groupby('agency_key'):
 print name
 print group

AG_1
  agency_key agent_key  payes  sold
0       AG_1     Mario      3    70
2       AG_1     Bruno     49    28
4       AG_1     Mario     42    19
AG_2
  agency_key agent_key  payes  sold
1       AG_2     Mario     36    53
3       AG_2     Bruno     70    61

<a id="dels"></a>
### DELETE

In [ ]:
baseball.drop([89525, 89526])

### UPDATE

In [2]:
frame2['debt'] = 16.5
print(frame2)
val = Series([10, 20, 30], index=['two', 'four', 'five'])
frame2['debt'] = val
print(frame2)
frame2['eastern'] = frame2.state == 'Ohio'
print(frame2)

NameError: name 'frame2' is not defined

### DELETE
###DROP orig data is not dropped!

In [58]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
print('ORIGINAL')
print(data)
print('delete where index/ROWID in (Colorado,Ohio)')
print(data.drop(['Colorado', 'Ohio']) )
print('DROP Column col1 ')
print(data.drop('two', axis=1))
print('antani pagliaccio')
print(data.drop(['two', 'four'], axis=1))

not a DELETE cause create a new OBJ
select * from (select * from T1 where ROWID<> c)
ORIGINAL
a    0
b    1
c    2
d    3
dtype: int32
without index C
a    0
b    1
d    3
dtype: int32
-------------------------------------
ORIGINAL
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
delete where index/ROWID in (Colorado,Ohio)
          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15
DROP Column col1
          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15
antani pagliaccio
          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

<a id="ad"></a>
###append

In [64]:
#append
df1 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],#Column 1
        'year': [2000, 2001, 2002, 2001, 2002],#Column 2
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}#Column 3
frame_1 = DataFrame(df1)
df2 =  {'state': ['New state','Barbados'],#Column 1
        'year': [2020,2021],#Column 2
        'pop': [3,0.1]}#Column 3
frame_2 = DataFrame(df2)
frame_NEW=frame_1.append(frame_2)
frame_NEW

   pop      state  year
0  1.5       Ohio  2000
1  1.7       Ohio  2001
2  3.6       Ohio  2002
3  2.4     Nevada  2001
4  2.9     Nevada  2002
0  3.0  New state  2020
1  0.1   Barbados  2021

<a id="trd"></a>
### TRANSPOSE

In [36]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [35]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

<a id="diffd"></a>
###Diff

In [1]:
#Diff
df1 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],#Column 1
        'year': [2000, 2001, 2002, 2001, 2002],#Column 2
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}#Column 3
frame_1 = DataFrame(df1)
df2 = {'state': ['Ohio', 'Zurich'],#Column 1
        'year': [2000, 2010],#Column 2
        'pop': [1.5, 1.7]}#Column 3

frame_2 = DataFrame(df2)
frame_DIFF=frame_1.diff(frame_2)
frame_DIFF

### ORDERING RANK SORT
<a id="ordd"></a>

###SORT

In [ ]:
df.sort_index(axis=1, ascending=False)
df.sort_values(by='B')
baseball_newind.sort_index().head()
baseball.hr.order(ascending=False)
baseball.hr.rank()

In [28]:
#############ALTERNATIVE
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
print(data)
print(data.ix['Colorado', ['two', 'three']])
print(data.ix[['Colorado', 'Utah'], [3, 0, 1]])

print(data.ix[2] )
print(data.ix[:'Utah', 'two'] )
print(data.ix[data.three > 5, :3] )

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
reindexed -------
a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
two      5
three    6
Name: Colorado, dtype: int32
          four  one  two
Colorado     7    4    5
Utah        11    8    9
one       8
two       9
three    10
four     11
Name: Utah, dtype: int32
Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32
          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

#### SORT index or axis (NON MUOVE I DATI MA L'INTERA COLONNA!!!)

In [87]:
#Order
obj = Series([99, 25, 25,0])
print( obj  )
print("Sort by Values")
print( obj.order()  )
print("Sort by Values (DESCENDING)")
print( obj.order(ascending=False)  )

frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
print( 'frame'   )
print( frame   )
print("SORT 1 SOLA COLONNA, le row restano ferme!!!!")
print( frame.sort_index(by='b')  )

0    99
1    25
2    25
3     0
dtype: int64
Sort by Values
3     0
1    25
2    25
0    99
dtype: int64
Sort by Values (DESCENDING)
0    99
2    25
1    25
3     0
dtype: int64
frame
   a  b
0  0  4
1  1  7
2  0 -3
3  1  2
SORT 1 SOLA COLONNA, le row restano ferme!!!!
   a  b
2  0 -3
3  1  2
0  0  4
1  1  7
Ranking (of Indexes)...some kind of weighting going on
0    4.0
1    2.5
2    2.5
3    1.0
dtype: float64

#### RANKING

In [74]:
#Ranking
print("Ranking (of Indexes)...some kind of weighting going on")#return the Rank of relative index
print(obj.rank())

#Ranking
frame = DataFrame({'b': [30, 40, 10, 20], 'a': [0, 1, 0, 1], 'c': [-2, 4, 8, -1000]})
print(frame)
print("Ranking : return the Rank in the AXIS")#return the Rank of relative index
print(frame.rank(axis=1))

   a   b     c
0  0  30    -2
1  1  40     4
2  0  10     8
3  1  20 -1000
Ranking : return the Rank of relative index
   a  b  c
0  2  3  1
1  1  3  2
2  1  3  2
3  2  3  1

In [76]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
print( obj   )
print( obj.index.is_unique   )

a    0
a    1
b    2
b    3
c    4
dtype: int64
False

###broadcast
<a id="broadcastd"></a>

In [63]:
frame = DataFrame(np.random.randn(2, 3), columns=list('bde')
                  , index=['Utah', 'Ohio'])
print('frame')
print(frame)
print('np.abs(frame)')
print(np.abs(frame))

frame
             b         d         e
Utah  0.606668 -0.138391  0.555978
Ohio -2.465031 -0.004143 -1.970257
np.abs(frame)
             b         d         e
Utah  0.606668  0.138391  0.555978
Ohio  2.465031  0.004143  1.970257

### LAMBDA FUNCTIONS (group by  ror or col)
<a id="lambdad"></a>

In [81]:
#apply function on a column level or row level
import numpy as np
frame = DataFrame( [[1,1,1],[3,4,5]],['row1','row2'],['col1','col2','col3'])
f = lambda x: x.max() - x.min()
print('frame')
print(frame)
print('Apply Lambda Function')
print(frame.apply(f) )
f_sum = lambda x: x.sum()
print('Apply Lambda Function f_sum:lambda x: x.sum()')
print(frame.apply(f_sum) )
print('Apply Lambda Function f_sum:lambda x: x.sum()')
print(frame.apply(f_sum,axis=1) )

frame
      col1  col2  col3
row1     1     1     1
row2     3     4     5
Apply Lambda Function
col1    2
col2    3
col3    4
dtype: int64
Apply Lambda Function f_sum:lambda x: x.sum()
col1    4
col2    5
col3    6
dtype: int64
Apply Lambda Function f_sum:lambda x: x.sum()
row1     3
row2    12
dtype: int64

### UNION :CONCAT (bind,stacking)

In [33]:
arr = np.arange(12).reshape((3, 4))
concatenated=np.concatenate([arr, arr], axis=1)
print(arr)
print(concatenated)

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[ 0  1  2  3  0  1  2  3]
 [ 4  5  6  7  4  5  6  7]
 [ 8  9 10 11  8  9 10 11]]

In [34]:
#Concat Series
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [35]:
pd.concat([s1, s2, s3], axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [37]:
s4 = pd.concat([s1 , s3])
s4
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

a    0
b    5
f    5
g    6
dtype: int64

# DELETE duplicates

In [28]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 'k2': [1, 1, 2, 3, 3, 4, 4]})
data
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [30]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [31]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

##binning
<a id="binning"></a>

In [32]:
#letture.codes
#letture.categories 
pd.value_counts(letture)

(100, 1000]    1
(10, 100]      0
dtype: int64

In [39]:
#Continuos to discrete
#Continuos  55, 22, 44,88, 27, 62
#Discrete
#0             X           X
#25                 X      
#50         X    
#75                    X       X
#100
ages = [55, 22, 44,88, 27, 62]
bins = [0, 25, 50, 75, 100]
customer = pd.cut(ages, bins)
customer

[(50, 75], (0, 25], (25, 50], (75, 100], (25, 50], (50, 75]]
Categories (4, object): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [45]:
#Rename the categories
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
customer = pd.cut(ages, bins,labels=group_names)
customer

[MiddleAged, Youth, YoungAdult, Senior, YoungAdult, MiddleAged]
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [40]:
pd.value_counts(customer)

(50, 75]     2
(25, 50]     2
(75, 100]    1
(0, 25]      1
dtype: int64

In [44]:
#Il bucket ti dice in quale quartile il dato e' caduto dentro
quartiled_data = pd.qcut(ages, 4) # Cut into quartiles
quartiled_data

[(49.5, 60.25], [22, 31.25], (31.25, 49.5], (60.25, 88], [22, 31.25], (60.25, 88]]
Categories (4, object): [[22, 31.25] < (31.25, 49.5] < (49.5, 60.25] < (60.25, 88]]

In [47]:
#Filtering outliar
np.random.seed(12345)
data = pd.DataFrame(np.random.randn(1000, 4))
#data
col = data[3]
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [46]:
#To select all rows having a value exceeding 3 or -3, you can use the any method on a boolean DataFrame:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

##file
<a id="file"></a>

In [ ]:
read_csv(skiprows=[3,4,6])
na_values=['?', -99999]